sim/simple_cylinder_k_wall_modeled/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1.223;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.223;
    }
    topBot
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        //type            nutUSpaldingWallFunction;
	  //type		kqRWallFunction;
        type            omegaWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
